Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཆོས་ཀྱི་སྟོང་པ་ཉིད་གང་ལགས་པ་དེ་ཡང་ཆོས་མ་ལགས། ཆོས་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མ་མཆིས་ཏེ།
en: The emptiness of mental phenomena is not mental phenomena, and emptiness does not exist elsewhere apart from mental phenomena.

source: ཆོས་ཉིད་ཀྱང་སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་ཀྱང་ཆོས་སོ།
en: The nature of mental phenomena is indeed emptiness, and emptiness indeed is mental phenomena.

source: །མིག་གི་རྣམ་པར་ཤེས་པ་མིག་གི་རྣམ་པར་ཤེས་པས་སྟོང་སྟེ།
en: Visual consciousness is empty of visual consciousness.

source: མིག་གི་རྣམ་པར་ཤེས་པའི་སྟོང་པ་ཉིད་གང་ལགས་པ་དེ་ཡང་མིག་གི་རྣམ་པར་ཤེས་པ་མ་ལགས། མིག་གི་རྣམ་པར་ཤེས་པ་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མ་མཆིས་ཏེ།
en: The emptiness of visual consciousness is not visual consciousness, and emptiness does not exist elsewhere apart from visual consciousness.

source: མིག་གི་རྣམ་པར་ཤེས་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད། སྟོང་པ་ཉིད་ཀྱང་མིག་གི་རྣམ་པར་ཤེས་པའོ།
en: The nature of visual consciousness is indeed emptiness, and emptiness indeed is visual consciousness.

source: །རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པས་སྟོང་སྟེ།
en: Auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness are empty of mental consciousness [and so forth].

source: ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་སྟོང་པ་ཉིད་གང་ལགས་པ་དེ་ཡང་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་མ་ལགས། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མ་མཆིས་ཏེ།
en: The emptiness of mental consciousness [and so forth] is not mental consciousness [and so forth], and emptiness does not exist elsewhere apart from mental consciousness [and so forth].

source: ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད། སྟོང་པ་ཉིད་ཀྱང་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའོ།
en: The nature of mental consciousness [and so forth] is indeed emptiness, and emptiness indeed is mental consciousness [and so forth].

source: །མིག་གི་འདུས་ཏེ་རེག་པ་མིག་གི་འདུས་ཏེ་རེག་པས་སྟོང་སྟེ།
en: Visually compounded sensory contact is empty of visually compounded sensory contact.

source: མིག་གི་འདུས་ཏེ་རེག་པའི་སྟོང་པ་ཉིད་གང་ལགས་པ་དེ་ཡང་མིག་གི་འདུས་ཏེ་རེག་པ་མ་ལགས། མིག་གི་འདུས་ཏེ་རེག་པ་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མ་མཆིས་ཏེ།
en: The emptiness of visually compounded sensory contact is not visually compounded sensory contact, and emptiness does not exist elsewhere apart from visually compounded sensory contact.

source: མིག་གི་འདུས་ཏེ་རེག་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད། སྟོང་པ་ཉིད་ཀྱང་མིག་གི་འདུས་ཏེ་རེག་པའོ།
en: The nature of visually compounded sensory contact is indeed emptiness, and emptiness indeed is visually compounded sensory contact.

source: །རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པས་སྟོང་སྟེ།
en: Aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact are empty of mentally compounded sensory contact [and so forth].

source: ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་སྟོང་པ་ཉིད་གང་ལགས་པ་དེ་ཡང་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་མ་ལགས། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མ་མཆིས་ཏེ།
en: The emptiness of mentally compounded sensory contact [and so forth] is not mentally compounded sensory contact [and so forth], and emptiness does not exist elsewhere apart from mentally compounded sensory contact [and so forth].

source: ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་སྟོང་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད། སྟོང་པ་ཉིད་ཀྱང་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའོ།
en: The nature of mentally compounded sensory contact [and so forth] is indeed emptiness, and emptiness indeed is mentally compounded sensory contact [and so forth].

source: །མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བས་སྟོང་སྟེ།
en: Feelings conditioned by visually compounded sensory contact are empty of feelings conditioned by visually compounded sensory contact.

source: མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་སྟོང་པ་ཉིད་གང་ལགས་པ་དེ་ཡང་མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་མ་ལགས། མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མ་མཆིས་ཏེ།
en: The emptiness of feelings conditioned by visually compounded sensory contact is not feelings conditioned by visually compounded sensory contact, and emptiness does not exist elsewhere apart from feelings conditioned by visually compounded sensory contact.

source: མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་ཀྱང་མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའོ།
en: The nature of feelings conditioned by visually compounded sensory contact is indeed emptiness, and emptiness indeed is feelings conditioned by visually compounded sensory contact.

source: །རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བས་སྟོང་སྟེ།
en: Feelings conditioned by aurally compounded sensory contact, feelings conditioned by nasally compounded sensory contact, feelings conditioned by lingually compounded sensory contact, feelings conditioned by corporeally compounded sensory contact, and feelings conditioned by mentally compounded sensory contact are empty of feelings conditioned by mentally compounded sensory contact [and so forth].

source: ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་སྟོང་པ་ཉིད་གང་ལགས་པ་དེ་ཡང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་མ་ལགས། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མ་མཆིས་ཏེ།
en: The emptiness of feelings conditioned by mentally compounded sensory contact [and so forth] is not feelings conditioned by mentally compounded sensory contact [and so forth], and emptiness does not exist elsewhere apart from feelings conditioned by mentally compounded sensory contact [and so forth].

source: ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ཉིད་ཀྱང་སྟོང་པ་ཉིད། སྟོང་པ་ཉིད་ཀྱང་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའོ།
en: The nature of feelings conditioned by mentally compounded sensory contact [and so forth] is indeed emptiness, and emptiness indeed is feelings conditioned by mentally compounded sensory contact [and so forth].

source: །སའི་ཁམས་སའི་ཁམས་ཀྱིས་སྟོང་སྟེ།
en: The earth element is empty of the earth element.

source: སའི་ཁམས་ཀྱི་སྟོང་པ་ཉིད་གང་ལགས་པ་དེ་ཡང་སའི་ཁམས་མ་ལགས། སའི་ཁམས་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མ་མཆིས་ཏེ།
en: The emptiness of the earth element is not the earth element, and emptiness does not exist elsewhere apart from the earth element.

source: སའི་ཁམས་ཉིད་ཀྱང་སྟོང་པ་ཉིད། སྟོང་པ་ཉིད་ཀྱང་སའི་ཁམས་སོ།
en: The nature of the earth element is indeed emptiness, and emptiness indeed is the earth element.

source: །ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱིས་སྟོང་སྟེ།
en: The water element, the fire element, the wind element, the space element, and the consciousness element are empty of the consciousness element [and so forth].

source: རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་སྟོང་པ་ཉིད་གང་ལགས་པ་དེ་ཡང་རྣམ་པར་ཤེས་པའི་ཁམས་མ་ལགས། རྣམ་པར་ཤེས་པའི་ཁམས་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མ་མཆིས་ཏེ།
en: The emptiness of the consciousness element [and so forth] is not the consciousness element [and so forth], and emptiness does not exist elsewhere apart from the consciousness element [and so forth].

source: རྣམ་པར་ཤེས་པའི་ཁམས་ཉིད་ཀྱང་སྟོང་པ་ཉིད། སྟོང་པ་ཉིད་ཀྱང་རྣམ་པར་ཤེས་པའི་ཁམས་སོ།
en: The nature of the consciousness element [and so forth] is indeed emptiness, and emptiness indeed is the consciousness element [and so forth]. “

source: །བཅོམ་ལྡན་འདས་མ་རིག་པ་མ་རིག་པས་སྟོང་སྟེ།
en: Blessed Lord, ignorance is empty of ignorance.

source: མ་རིག་པའི་སྟོང་པ་ཉིད་གང་ལགས་པ་དེ་ཡང་མ་རིག་པ་མ་ལགས། མ་རིག་པ་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མ་མཆིས་ཏེ། མ་རིག་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད།
en: The emptiness of ignorance is not ignorance, and emptiness does not exist elsewhere apart from ignorance.

source: སྟོང་པ་ཉིད་ཀྱང་མ་རིག་པའོ། །འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དང་།
en: The nature of ignorance is indeed emptiness, and emptiness indeed is ignorance.

source: མིང་དང་གཟུགས་དང་། སྐྱེ་མཆེད་དྲུག་དང་། རེག་པ་དང་། ཚོར་བ་དང་། སྲེད་པ་དང་།
en: Formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, and aging and death are empty of aging and death [and so forth]. {

source: ལེན་པ་དང་། སྲིད་པ་དང་། སྐྱེ་བ་དང་། རྒ་ཤི་རྒ་ཤིས་སྟོང་སྟེ། རྒ་ཤིའི་སྟོང་པ་ཉིད་གང་ལགས་པ་དེ་ཡང་རྒ་ཤི་མ་ལགས།
en: Dt.130} The emptiness of aging and death [and so forth] is not aging and death [and so forth], and emptiness does not exist elsewhere apart from aging and death [and so forth].

source: རྒ་ཤི་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མ་མཆིས་ཏེ། རྒ་ཤི་ཉིད་ཀྱང་སྟོང་པ་ཉིད། སྟོང་པ་ཉིད་ཀྱང་རྒ་ཤིའོ། །བཅོམ་ལྡན་འདས་རྣམ་གྲངས་དེས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ།
en: The nature of aging and death [and so forth] is indeed emptiness, and emptiness indeed is aging and death [and so forth].

source: མ་རིག་པ་ལ་གནས་པར་མི་བགྱིའོ། །འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དང་། མིང་དང་གཟུགས་དང་། སྐྱེ་མཆེད་དྲུག་དང་། རེག་པ་དང་། ཚོར་བ་དང་། སྲེད་པ་དང་། ལེན་པ་དང་།
en: Blessed Lord, those are the formulations explaining how, when bodhisattva great beings practice the perfection of wisdom, they should not dwell in ignorance, and they should not dwell in formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, or aging and death. “

source: སྲིད་པ་དང་། སྐྱེ་བ་དང་། རྒ་ཤི་ལ་གནས་པར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པར་མི་བགྱི་སྟེ།
en: Moreover, Blessed Lord, when bodhisattva great beings practice the perfection of wisdom, they should not dwell in the perfection of generosity.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པས་སྟོང་སྟེ།
en: If you ask why, Blessed Lord, it is because the perfection of generosity is empty of the perfection of generosity.

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་སྟོང་པ་ཉིད་གང་ལགས་པ་དེ་ཡང་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ལགས། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མ་མཆིས་ཏེ།
en: The emptiness of the perfection of generosity is not the perfection of generosity, and emptiness does not exist elsewhere apart from the perfection of generosity.

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད། སྟོང་པ་ཉིད་ཀྱང་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: The nature of the perfection of generosity is indeed emptiness, and emptiness indeed is the perfection of generosity.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པར་མི་བགྱི་སྟེ།
en: They should not dwell in the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་སྟོང་སྟེ།
en: If one were to ask why, it is because the perfection of wisdom [and so forth] are empty of the perfection of wisdom [and so forth].

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་སྟོང་པ་ཉིད་གང་ལགས་པ་དེ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ལགས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མ་མཆིས་ཏེ།
en: The emptiness of the perfection of wisdom [and so forth] is not the perfection of wisdom [and so forth], and emptiness does not exist elsewhere apart from the perfection of wisdom [and so forth].

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད། སྟོང་པ་ཉིད་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་རྣམ་གྲངས་དེས་ན།
en: The nature of the perfection of wisdom [and so forth] is indeed emptiness, and emptiness indeed is the perfection of wisdom [and so forth].

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་གནས་པར་མི་བགྱིའོ།
en: Blessed Lord, those are the formulations explaining how, when bodhisattva great beings practice the perfection of wisdom, they should not dwell in the six perfections. “

source: །བཅོམ་ལྡན་འདས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ལ་གནས་པར་མི་བགྱི་སྟེ། དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས།
en: Moreover, Blessed Lord, when bodhisattva great beings practice the perfection of wisdom, they should not dwell in the four applications of mindfulness.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱིས་སྟོང་སྟེ།
en: If one were to ask why, it is because the applications of mindfulness are empty of the applications of mindfulness.

source: དྲན་པ་ཉེ་བར་གཞག་པའི་སྟོང་པ་ཉིད་གང་ལགས་པ་དེ་ཡང་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་མ་ལགས། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མ་མཆིས་ཏེ།
en: The emptiness of the applications of mindfulness is not the applications of mindfulness, and emptiness does not exist elsewhere apart from the applications of mindfulness.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱང་སྟོང་པ་ཉིད། སྟོང་པ་ཉིད་ཀྱང་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་སོ། །ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་བ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་།
en: The nature of the applications of mindfulness is indeed emptiness, and emptiness indeed is the applications of mindfulness.

source: སྨོན་པ་མེད་པ་དང་། ཏིང་ངེ་འཛིན་དང་། མངོན་པར་ཤེས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་།
en: They should not dwell in the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the meditative stabilities, the extrasensory powers, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, or the eighteen distinct qualities of the buddhas.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་གནས་པར་མི་བགྱི་སྟེ། དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱིས་སྟོང་སྟེ།
en: If one were to ask why, Blessed Lord, it is because the eighteen distinct qualities of the buddhas [and all the aforementioned attributes] are empty of the eighteen distinct qualities of the buddhas [and all the aforementioned attributes].

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་སྟོང་པ་ཉིད་གང་ལགས་པ་དེ་ཡང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་མ་ལགས། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མ་མཆིས་ཏེ།
en: The emptiness of the eighteen distinct qualities of the buddhas [and all the aforementioned attributes] is not the eighteen distinct qualities of the buddhas [and all the aforementioned attributes], and emptiness does not exist elsewhere apart from the eighteen distinct qualities of the buddhas [and all the aforementioned attributes].

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱང་སྟོང་པ་ཉིད། སྟོང་པ་ཉིད་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་བ་རྣམས་སོ།
en: The nature of the eighteen distinct qualities of the buddhas [and all the aforementioned attributes] is indeed emptiness, and emptiness indeed is the eighteen distinct qualities of the buddhas [and all the aforementioned attributes].

source: །བཅོམ་ལྡན་འདས་རྣམ་གྲངས་དེས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་གནས་པར་མི་བགྱིའོ།
en: Blessed Lord, those are the formulations explaining how, when bodhisattva great beings practice the perfection of wisdom, they should not dwell in the eighteen distinct attributes of the buddhas [and the aforementioned attributes]. “

source: །བཅོམ་ལྡན་འདས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཡི་གེ་རྣམས་ལ་གནས་པར་མི་བགྱི་སྟེ།
en: Moreover, Blessed Lord, when bodhisattva great beings practice the perfection of wisdom, they should not dwell in syllables.

source: ཡི་གེ་མངོན་པར་བསྒྲུབ་པ་ལ་གནས་པར་མི་བགྱིའོ།
en: They should not dwell in the words that these form.

source: །གཅིག་ཏུ་བརྗོད་པ་ལ་གནས་པར་མི་བགྱི། གཉིས་སུ་བརྗོད་པ་ལ་གནས་པར་མི་བགྱི། ཐ་དད་ཏུ་བརྗོད་པ་ལ་གནས་པར་མི་བགྱིའོ།
en: They should not dwell in singular expressions, dual expressions, or plural expressions.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་ཡི་གེ་རྣམས་ཡི་གེ་རྣམས་ཀྱིས་སྟོང་སྟེ།
en: If one were to ask why, Blessed Lord, it is because the syllables are empty of the syllables.

source: ཡི་གེ་རྣམས་ཀྱི་སྟོང་པ་ཉིད་གང་ལགས་པ་དེ་ཡང་ཡི་གེ་རྣམས་མ་ལགས། ཡི་གེ་རྣམས་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མ་མཆིས་ཏེ།
en: The emptiness of the syllables is not the syllables, and emptiness does not exist elsewhere apart from the syllables.

source: ཡི་གེ་རྣམས་ཀྱང་སྟོང་པ་ཉིད། སྟོང་པ་ཉིད་ཀྱང་ཡི་གེ་རྣམས་སོ།
en: The nature of the syllables is indeed emptiness, and emptiness indeed is the syllables.

source: །བཅོམ་ལྡན་འདས་རྣམ་གྲངས་དེས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཡི་གེ་རྣམས་ལ་གནས་པར་མི་བགྱིའོ།
en: Blessed Lord, those are the formulations explaining how, when bodhisattva great beings practice the perfection of wisdom, they should not dwell in the syllables. “

source: །བཅོམ་ལྡན་འདས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། མངོན་པར་ཤེས་པ་རྣམས་ལ་གནས་པར་མི་བགྱི་སྟེ།
en: Moreover, Blessed Lord, {Dt.131} when bodhisattva great beings practice the perfection of wisdom, they should not dwell in the extrasensory powers.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་མངོན་པར་ཤེས་པ་རྣམས་མངོན་པར་ཤེས་པ་རྣམས་ཀྱིས་སྟོང་སྟེ།
en: If one were to ask why, Blessed Lord, it is because the extrasensory powers are empty of the extrasensory powers.

source: མངོན་པར་ཤེས་པ་རྣམས་ཀྱི་སྟོང་པ་ཉིད་གང་ལགས་པ་དེ་ཡང་། མངོན་པར་ཤེས་པ་རྣམས་མ་ལགས། མངོན་པར་ཤེས་པ་རྣམས་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མ་མཆིས་ཏེ།
en: The emptiness of the extrasensory powers is not the extrasensory powers, and emptiness does not exist elsewhere apart from the extrasensory powers.

source: མངོན་པར་ཤེས་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད། སྟོང་པ་ཉིད་ཀྱང་མངོན་པར་ཤེས་པ་རྣམས་སོ།
en: The nature of the extrasensory powers is indeed emptiness, and emptiness indeed is the extrasensory powers.

source: །བཅོམ་ལྡན་འདས་རྣམ་གྲངས་དེས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། མངོན་པར་ཤེས་པ་རྣམས་ལ་གནས་པར་མི་བགྱིའོ།
en: Blessed Lord, those are the formulations explaining how, when bodhisattva great beings practice the perfection of wisdom, they should not dwell in the extrasensory powers. “

source: །ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་གནས་པར་མི་བགྱི་སྟེ།
en: They should not dwell in the gateways of the meditative stabilities or the dhāraṇīs.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་གཟུངས་ཀྱི་སྒོ་རྣམས་གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱིས་སྟོང་སྟེ།
en: If one were to ask why, Blessed Lord, it is because the dhāraṇī gateways [and so forth] are empty of the dhāraṇī gateways [and so forth].

source: གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱི་སྟོང་པ་ཉིད་གང་ལགས་པ་དེ་ཡང་གཟུངས་ཀྱི་སྒོ་རྣམས་མ་ལགས། གཟུངས་ཀྱི་སྒོ་རྣམས་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མ་མཆིས་ཏེ།
en: The emptiness of the dhāraṇī gateways [and so forth] is not the dhāraṇī gateways [and so forth], and emptiness does not exist elsewhere apart from the dhāraṇī gateways [and so forth].

source: གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱང་སྟོང་པ་ཉིད། སྟོང་པ་ཉིད་ཀྱང་གཟུངས་ཀྱི་སྒོ་རྣམས་སོ། །བཅོམ་ལྡན་འདས་རྣམ་གྲངས་དེས་ན།
en: The nature of the dhāraṇī gateways [and so forth] is indeed emptiness, and emptiness indeed is the dhāraṇī gateways [and so forth].

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་གནས་པར་མི་བགྱིའོ།
en: Blessed Lord, those are the formulations explaining how, when bodhisattva great beings practice the perfection of wisdom, they should not dwell in the dhāraṇīs [and so forth]. “

source: །བཅོམ་ལྡན་འདས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གཟུགས་མི་རྟག་གོ་ཞེས་བགྱི་བར་གནས་པར་མི་བགྱི་སྟེ།
en: Moreover, Blessed Lord, when bodhisattva great beings practice the perfection of wisdom, they should not dwell in the notion that physical forms are impermanent.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་གཟུགས་མི་རྟག་པ། གཟུགས་མི་རྟག་པ་ཉིད་ཀྱིས་སྟོང་སྟེ།
en: If one were to ask why, Blessed Lord, it is because the impermanence of physical forms is empty of the impermanence of physical forms.

source: གཟུགས་མི་རྟག་པ་ཉིད་ཀྱི་སྟོང་པ་ཉིད་གང་ལགས་པ་དེ་ཡང་གཟུགས་མི་རྟག་པ་ཉིད་མ་ལགས། གཟུགས་མི་རྟག་པ་ཉིད་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མ་མཆིས་ཏེ།
en: The emptiness of the impermanence of physical forms is not the impermanence of physical forms, and emptiness does not exist elsewhere apart from the impermanence of physical forms.

source: གཟུགས་མི་རྟག་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད། སྟོང་པ་ཉིད་ཀྱང་གཟུགས་མི་རྟག་པ་ཉིད་དོ།
en: The nature of the impermanence of physical forms is indeed emptiness, and emptiness indeed is the impermanence of physical forms.

source: །བཅོམ་ལྡན་འདས་རྣམ་གྲངས་དེས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གཟུགས་མི་རྟག་གོ་ཞེས་བགྱི་བར་གནས་པར་མི་བགྱིའོ།
en: Blessed Lord, those are the formulations explaining how, when bodhisattva great beings practice the perfection of wisdom, they should not dwell in the notion that physical forms are impermanent. “

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མི་རྟག་གོ་ཞེས་བགྱི་བར་གནས་པར་མི་བགྱི་སྟེ།
en: They should not dwell in the notion that feelings, perceptions, formative predispositions, and consciousness are impermanent.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་རྣམ་པར་ཤེས་པ་མི་རྟག་པ། རྣམ་པར་ཤེས་པ་མི་རྟག་པ་ཉིད་ཀྱིས་སྟོང་སྟེ།
en: If one were to ask why, Blessed Lord, it is because the impermanence of consciousness [and so forth] is empty of the impermanence of consciousness [and so forth].

source: རྣམ་པར་ཤེས་པ་མི་རྟག་པ་ཉིད་ཀྱི་སྟོང་པ་ཉིད་གང་ལགས་པ་དེ་ཡང་རྣམ་པར་ཤེས་པ་མི་རྟག་པ་ཉིད་མ་ལགས། རྣམ་པར་ཤེས་པ་མི་རྟག་པ་ཉིད་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མ་མཆིས་ཏེ།
en: The emptiness of the impermanence of consciousness [and so forth] is not the impermanence of consciousness [and so forth], and emptiness does not exist elsewhere apart from the impermanence of consciousness [and so forth].

source: རྣམ་པར་ཤེས་པ་མི་རྟག་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད། སྟོང་པ་ཉིད་ཀྱང་རྣམ་པར་ཤེས་པ་མི་རྟག་པ་ཉིད་དོ།
en: The nature of the impermanence of consciousness [and so forth] is indeed emptiness, and emptiness indeed is the impermanence of consciousness [and so forth].

source: །བཅོམ་ལྡན་འདས་རྣམ་གྲངས་དེས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། རྣམ་པར་ཤེས་པ་མི་རྟག་གོ་ཞེས་བགྱི་བར་གནས་པར་མི་བགྱིའོ།
en: Blessed Lord, those are the formulations explaining how, when bodhisattva great beings practice the perfection of wisdom, they should not dwell in the notion that consciousness [and so forth] are impermanent. “

source: །གཟུགས་སྡུག་བསྔལ་ལོ་ཞེས་བགྱི་བར་གནས་པར་མི་བགྱི་སྟེ།
en: They should not dwell in the notion that physical forms are imbued with suffering.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་ནི་འདི་ལྟར་གཟུགས་སྡུག་བསྔལ་བ་ཉིད། གཟུགས་སྡུག་བསྔལ་བ་ཉིད་ཀྱིས་སྟོང་སྟེ།
en: If one were to ask why, it is because the suffering of physical forms is empty of the suffering of physical forms.
